        Layer (type)               Output Shape         Param #
================================================================
            Conv2d-1          [1, 32, 112, 112]             864
       BatchNorm2d-2          [1, 32, 112, 112]              64
              ReLU-3          [1, 32, 112, 112]               0
            Conv2d-4          [1, 32, 112, 112]           1,024
       BatchNorm2d-5          [1, 32, 112, 112]              64
              ReLU-6          [1, 32, 112, 112]               0
            Conv2d-7          [1, 32, 112, 112]             288
       BatchNorm2d-8          [1, 32, 112, 112]              64
              ReLU-9          [1, 32, 112, 112]               0
           Conv2d-10          [1, 16, 112, 112]             512
      BatchNorm2d-11          [1, 16, 112, 112]              32
 InvertedResidual-12          [1, 16, 112, 112]               0
           Conv2d-13          [1, 96, 112, 112]           1,536
      BatchNorm2d-14          [1, 96, 112, 112]             192
             ReLU-15          [1, 96, 112, 112]               0
           Conv2d-16            [1, 96, 56, 56]             864
      BatchNorm2d-17            [1, 96, 56, 56]             192
             ReLU-18            [1, 96, 56, 56]               0
           Conv2d-19            [1, 24, 56, 56]           2,304
      BatchNorm2d-20            [1, 24, 56, 56]              48
 InvertedResidual-21            [1, 24, 56, 56]               0
           Conv2d-22           [1, 144, 56, 56]           3,456
      BatchNorm2d-23           [1, 144, 56, 56]             288
             ReLU-24           [1, 144, 56, 56]               0
           Conv2d-25           [1, 144, 56, 56]           1,296
      BatchNorm2d-26           [1, 144, 56, 56]             288
             ReLU-27           [1, 144, 56, 56]               0
           Conv2d-28            [1, 24, 56, 56]           3,456
      BatchNorm2d-29            [1, 24, 56, 56]              48
 InvertedResidual-30            [1, 24, 56, 56]               0
           Conv2d-31           [1, 144, 56, 56]           3,456
      BatchNorm2d-32           [1, 144, 56, 56]             288
             ReLU-33           [1, 144, 56, 56]               0
           Conv2d-34           [1, 144, 28, 28]           1,296
      BatchNorm2d-35           [1, 144, 28, 28]             288
             ReLU-36           [1, 144, 28, 28]               0
           Conv2d-37            [1, 32, 28, 28]           4,608
      BatchNorm2d-38            [1, 32, 28, 28]              64
 InvertedResidual-39            [1, 32, 28, 28]               0
           Conv2d-40           [1, 192, 28, 28]           6,144
      BatchNorm2d-41           [1, 192, 28, 28]             384
             ReLU-42           [1, 192, 28, 28]               0
           Conv2d-43           [1, 192, 28, 28]           1,728
      BatchNorm2d-44           [1, 192, 28, 28]             384
             ReLU-45           [1, 192, 28, 28]               0
           Conv2d-46            [1, 32, 28, 28]           6,144
      BatchNorm2d-47            [1, 32, 28, 28]              64
 InvertedResidual-48            [1, 32, 28, 28]               0
           Conv2d-49           [1, 192, 28, 28]           6,144
      BatchNorm2d-50           [1, 192, 28, 28]             384
             ReLU-51           [1, 192, 28, 28]               0
           Conv2d-52           [1, 192, 28, 28]           1,728
      BatchNorm2d-53           [1, 192, 28, 28]             384
             ReLU-54           [1, 192, 28, 28]               0
           Conv2d-55            [1, 32, 28, 28]           6,144
      BatchNorm2d-56            [1, 32, 28, 28]              64
 InvertedResidual-57            [1, 32, 28, 28]               0
           Conv2d-58           [1, 192, 28, 28]           6,144
      BatchNorm2d-59           [1, 192, 28, 28]             384
             ReLU-60           [1, 192, 28, 28]               0
           Conv2d-61           [1, 192, 14, 14]           1,728
      BatchNorm2d-62           [1, 192, 14, 14]             384
             ReLU-63           [1, 192, 14, 14]               0
           Conv2d-64            [1, 64, 14, 14]          12,288
      BatchNorm2d-65            [1, 64, 14, 14]             128
 InvertedResidual-66            [1, 64, 14, 14]               0
           Conv2d-67           [1, 384, 14, 14]          24,576
      BatchNorm2d-68           [1, 384, 14, 14]             768
             ReLU-69           [1, 384, 14, 14]               0
           Conv2d-70           [1, 384, 14, 14]           3,456
      BatchNorm2d-71           [1, 384, 14, 14]             768
             ReLU-72           [1, 384, 14, 14]               0
           Conv2d-73            [1, 64, 14, 14]          24,576
      BatchNorm2d-74            [1, 64, 14, 14]             128
 InvertedResidual-75            [1, 64, 14, 14]               0
           Conv2d-76           [1, 384, 14, 14]          24,576
      BatchNorm2d-77           [1, 384, 14, 14]             768
             ReLU-78           [1, 384, 14, 14]               0
           Conv2d-79           [1, 384, 14, 14]           3,456
      BatchNorm2d-80           [1, 384, 14, 14]             768
             ReLU-81           [1, 384, 14, 14]               0
           Conv2d-82            [1, 64, 14, 14]          24,576
      BatchNorm2d-83            [1, 64, 14, 14]             128
 InvertedResidual-84            [1, 64, 14, 14]               0
           Conv2d-85           [1, 384, 14, 14]          24,576
      BatchNorm2d-86           [1, 384, 14, 14]             768
             ReLU-87           [1, 384, 14, 14]               0
           Conv2d-88           [1, 384, 14, 14]           3,456
      BatchNorm2d-89           [1, 384, 14, 14]             768
             ReLU-90           [1, 384, 14, 14]               0
           Conv2d-91            [1, 64, 14, 14]          24,576
      BatchNorm2d-92            [1, 64, 14, 14]             128
 InvertedResidual-93            [1, 64, 14, 14]               0
           Conv2d-94           [1, 384, 14, 14]          24,576
      BatchNorm2d-95           [1, 384, 14, 14]             768
             ReLU-96           [1, 384, 14, 14]               0
           Conv2d-97           [1, 384, 14, 14]           3,456
      BatchNorm2d-98           [1, 384, 14, 14]             768
             ReLU-99           [1, 384, 14, 14]               0
          Conv2d-100            [1, 96, 14, 14]          36,864
     BatchNorm2d-101            [1, 96, 14, 14]             192
InvertedResidual-102            [1, 96, 14, 14]               0
          Conv2d-103           [1, 576, 14, 14]          55,296
     BatchNorm2d-104           [1, 576, 14, 14]           1,152
            ReLU-105           [1, 576, 14, 14]               0
          Conv2d-106           [1, 576, 14, 14]           5,184
     BatchNorm2d-107           [1, 576, 14, 14]           1,152
            ReLU-108           [1, 576, 14, 14]               0
          Conv2d-109            [1, 96, 14, 14]          55,296
     BatchNorm2d-110            [1, 96, 14, 14]             192
InvertedResidual-111            [1, 96, 14, 14]               0
          Conv2d-112           [1, 576, 14, 14]          55,296
     BatchNorm2d-113           [1, 576, 14, 14]           1,152
            ReLU-114           [1, 576, 14, 14]               0
          Conv2d-115           [1, 576, 14, 14]           5,184
     BatchNorm2d-116           [1, 576, 14, 14]           1,152
            ReLU-117           [1, 576, 14, 14]               0
          Conv2d-118            [1, 96, 14, 14]          55,296
     BatchNorm2d-119            [1, 96, 14, 14]             192
InvertedResidual-120            [1, 96, 14, 14]               0
          Conv2d-121           [1, 576, 14, 14]          55,296
     BatchNorm2d-122           [1, 576, 14, 14]           1,152
            ReLU-123           [1, 576, 14, 14]               0
          Conv2d-124             [1, 576, 7, 7]           5,184
     BatchNorm2d-125             [1, 576, 7, 7]           1,152
            ReLU-126             [1, 576, 7, 7]               0
          Conv2d-127             [1, 160, 7, 7]          92,160
     BatchNorm2d-128             [1, 160, 7, 7]             320
InvertedResidual-129             [1, 160, 7, 7]               0
          Conv2d-130             [1, 960, 7, 7]         153,600
     BatchNorm2d-131             [1, 960, 7, 7]           1,920
            ReLU-132             [1, 960, 7, 7]               0
          Conv2d-133             [1, 960, 7, 7]           8,640
     BatchNorm2d-134             [1, 960, 7, 7]           1,920
            ReLU-135             [1, 960, 7, 7]               0
          Conv2d-136             [1, 160, 7, 7]         153,600
     BatchNorm2d-137             [1, 160, 7, 7]             320
InvertedResidual-138             [1, 160, 7, 7]               0
          Conv2d-139             [1, 960, 7, 7]         153,600
     BatchNorm2d-140             [1, 960, 7, 7]           1,920
            ReLU-141             [1, 960, 7, 7]               0
          Conv2d-142             [1, 960, 7, 7]           8,640
     BatchNorm2d-143             [1, 960, 7, 7]           1,920
            ReLU-144             [1, 960, 7, 7]               0
          Conv2d-145             [1, 160, 7, 7]         153,600
     BatchNorm2d-146             [1, 160, 7, 7]             320
InvertedResidual-147             [1, 160, 7, 7]               0
          Conv2d-148             [1, 960, 7, 7]         153,600
     BatchNorm2d-149             [1, 960, 7, 7]           1,920
            ReLU-150             [1, 960, 7, 7]               0
          Conv2d-151             [1, 960, 7, 7]           8,640
     BatchNorm2d-152             [1, 960, 7, 7]           1,920
            ReLU-153             [1, 960, 7, 7]               0
          Conv2d-154             [1, 320, 7, 7]         307,200
     BatchNorm2d-155             [1, 320, 7, 7]             640
InvertedResidual-156             [1, 320, 7, 7]               0
          Conv2d-157             [1, 320, 7, 7]           2,880
     BatchNorm2d-158             [1, 320, 7, 7]             640
            ReLU-159             [1, 320, 7, 7]               0
          Conv2d-160              [1, 96, 7, 7]          30,720
     BatchNorm2d-161              [1, 96, 7, 7]             192
            ReLU-162              [1, 96, 7, 7]               0
          Conv2d-163              [1, 96, 7, 7]             864
     BatchNorm2d-164              [1, 96, 7, 7]             192
            ReLU-165              [1, 96, 7, 7]               0
          Conv2d-166              [1, 96, 7, 7]           9,216
     BatchNorm2d-167              [1, 96, 7, 7]             192
          Conv2d-168              [1, 96, 7, 7]          30,720
     BatchNorm2d-169              [1, 96, 7, 7]             192
            ReLU-170              [1, 96, 7, 7]               0
   ResidualBlock-171              [1, 96, 7, 7]               0
 ConvTranspose2d-172            [1, 96, 14, 14]         147,456
          Conv2d-173            [1, 96, 14, 14]             864
     BatchNorm2d-174            [1, 96, 14, 14]             192
            ReLU-175            [1, 96, 14, 14]               0
          Conv2d-176            [1, 32, 14, 14]           3,072
     BatchNorm2d-177            [1, 32, 14, 14]              64
            ReLU-178            [1, 32, 14, 14]               0
          Conv2d-179            [1, 32, 14, 14]             288
     BatchNorm2d-180            [1, 32, 14, 14]              64
            ReLU-181            [1, 32, 14, 14]               0
          Conv2d-182            [1, 32, 14, 14]           1,024
     BatchNorm2d-183            [1, 32, 14, 14]              64
          Conv2d-184            [1, 32, 14, 14]           3,072
     BatchNorm2d-185            [1, 32, 14, 14]              64
            ReLU-186            [1, 32, 14, 14]               0
   ResidualBlock-187            [1, 32, 14, 14]               0
 ConvTranspose2d-188            [1, 32, 28, 28]          16,384
          Conv2d-189            [1, 32, 28, 28]             288
     BatchNorm2d-190            [1, 32, 28, 28]              64
            ReLU-191            [1, 32, 28, 28]               0
          Conv2d-192            [1, 24, 28, 28]             768
     BatchNorm2d-193            [1, 24, 28, 28]              48
            ReLU-194            [1, 24, 28, 28]               0
          Conv2d-195            [1, 24, 28, 28]             216
     BatchNorm2d-196            [1, 24, 28, 28]              48
            ReLU-197            [1, 24, 28, 28]               0
          Conv2d-198            [1, 24, 28, 28]             576
     BatchNorm2d-199            [1, 24, 28, 28]              48
          Conv2d-200            [1, 24, 28, 28]             768
     BatchNorm2d-201            [1, 24, 28, 28]              48
            ReLU-202            [1, 24, 28, 28]               0
   ResidualBlock-203            [1, 24, 28, 28]               0
 ConvTranspose2d-204            [1, 24, 56, 56]           9,216
          Conv2d-205            [1, 24, 56, 56]             216
     BatchNorm2d-206            [1, 24, 56, 56]              48
            ReLU-207            [1, 24, 56, 56]               0
          Conv2d-208            [1, 16, 56, 56]             384
     BatchNorm2d-209            [1, 16, 56, 56]              32
            ReLU-210            [1, 16, 56, 56]               0
          Conv2d-211            [1, 16, 56, 56]             144
     BatchNorm2d-212            [1, 16, 56, 56]              32
            ReLU-213            [1, 16, 56, 56]               0
          Conv2d-214            [1, 16, 56, 56]             256
     BatchNorm2d-215            [1, 16, 56, 56]              32
          Conv2d-216            [1, 16, 56, 56]             384
     BatchNorm2d-217            [1, 16, 56, 56]              32
            ReLU-218            [1, 16, 56, 56]               0
   ResidualBlock-219            [1, 16, 56, 56]               0
 ConvTranspose2d-220          [1, 16, 112, 112]           4,096
          Conv2d-221          [1, 16, 112, 112]             144
     BatchNorm2d-222          [1, 16, 112, 112]              32
            ReLU-223          [1, 16, 112, 112]               0
          Conv2d-224           [1, 8, 112, 112]             128
     BatchNorm2d-225           [1, 8, 112, 112]              16
            ReLU-226           [1, 8, 112, 112]               0
          Conv2d-227           [1, 8, 112, 112]              72
     BatchNorm2d-228           [1, 8, 112, 112]              16
            ReLU-229           [1, 8, 112, 112]               0
          Conv2d-230           [1, 8, 112, 112]              64
     BatchNorm2d-231           [1, 8, 112, 112]              16
          Conv2d-232           [1, 8, 112, 112]             128
     BatchNorm2d-233           [1, 8, 112, 112]              16
            ReLU-234           [1, 8, 112, 112]               0
   ResidualBlock-235           [1, 8, 112, 112]               0
 ConvTranspose2d-236           [1, 8, 224, 224]           1,024
          Conv2d-237           [1, 2, 224, 224]             144
